# Manipulación de datos en Python

Es muy útil poder leer datos, pero es aún más útil poder modificarlos a nuestro antojo.

Hay varias maneras de hacer esto,usando diferentes módulos de Python.

# Usando Pandas
## Carga de bases de datos

Una de las mejores opciones para trabajar con datos tabulares en Python es usar el modulo **pandas**. La biblioteca **pandas** provee estructuras de datos, genera gráficos de alta calidad con matplotlib y se integra de buena forma con otras bibliotecas que usan arrays de NumPy (la cual es otra biblioteca de Python).

El beneficio frente a otros paquetes es el de cargar las información en forma de DataFrame, la cual  es una estructura de datos con dos dimensiones en la cual se puede guardar datos de distintos tipos (como caractéres, enteros, valores de punto flotante, factores y más) en columnas. 

El uso de las funciones en el modulo para cargar datos dependerá de el formato del archivo a cargar.



| **Formato** | **Código** |
| :---: | :---: |
|csv|pandas.read_csv|
|xls o xlsx|pandas.read_excel|
|txt|pandas.read_csv|
|sql|pandas.read_sql|

Para esto debemos instalar el modulo de python llamado xlrd, la siguiente sentencia nos ayuda a hacer la instalación.

In [68]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\users\antonino\anaconda3\ana\lib\site-packages (1.2.0)

## Carga de archivo  excel

In [93]:
import pandas as pd
data=pd.read_excel("C:/Users/Antonino/Desktop/Base1.xlsx","Hoja2",index_col=0,header=0)
data.head()# es util para verificar la cabecerade los datos

              SO2  Neg,Temp  Empresas  Población  Viento  Precipitación  Dias
Phoenix        10      70.3       213        582     6.0           7.05    36
Miami          10      75.5       207        335     9.0          59.80   128
Memphis        10      61.6       337        624     9.2          49.10   105
Houston        10      68.9       721       1233    10.8          48.19   103
Alburquerque   11      56.8        46        244     8.9           7.77    58

para verificar la estructura de los datos podemos usar el comando type()

In [87]:
data.dtypes

SO2                int64
Neg,Temp         float64
Empresas           int64
Población          int64
Viento           float64
Precipitación    float64
Dias               int64
dtype: object

## Carga de archivo  txt

In [88]:
data2=pd.read_csv("C:/Users/Antonino/Desktop/data.txt",delimiter=";",header=0,index_col=None,decimal=".")
print(data2)

   x1  x2  x3  x4  x5
0   1   2   3   4   5
1   6   7   8   9  10

para conocer la dimensión del Data.Frame usamos la sentencia shape

In [89]:
data2.shape

(2, 5)

# Cargar datos desde Internet

Para esto, basta suministrar la dirección url donde se encuentran alojados los datos e importar ciertos atributos del módulo **urllib**:

In [90]:
url = "https://raw.githubusercontent.com/jbrownlee/Datasets/master/pima-indians-diabetes.data.csv"
data3= pd.read_csv(url,header=None)
print("Las primeras 3 filas son \n \n", data3.head(3),"\n\n")
print("La estructura de cada columna es \n \n", data3.dtypes)

Las primeras 3 filas son

    0    1   2   3  4     5      6   7  8
0  6  148  72  35  0  33.6  0.627  50  1
1  1   85  66  29  0  26.6  0.351  31  0
2  8  183  64   0  0  23.3  0.672  32  1


La estructura de cada columna es

 0      int64
1      int64
2      int64
3      int64
4      int64
5    float64
6    float64
7      int64
8      int64
dtype: object

Es posible cambiar la estructura de cada una de las columnas en nuestro Data.Frame, esto puede ser directamente al cargar nuestra base o luego de esto, para el conjunto de datos data3 cambiaremos la estructura de la variable 1

In [91]:
data3.rename(columns={0:'V1',1:'V2'}, inplace=True)
data3.columns

Index(['V1', 'V2', 2, 3, 4, 5, 6, 7, 8], dtype='object')

In [92]:
data3.V1 = data3.V1.astype(str)
print("La estructura de cada columna es \n \n", data3.dtypes)

La estructura de cada columna es

 V1     object
V2      int64
2       int64
3       int64
4       int64
5     float64
6     float64
7       int64
8       int64
dtype: object

## Seleccionar filas y columnas
Para seleccionar un conjunto de filas , podemos usar la sentencia iloc

la estructura para la función iloc es 

data.iloc[__filas__,__columnas__]

In [107]:
data.iloc[[0,1,2],:]
x=np.array([True,False])

x = np.array(["A", "B"])
print np.repeat(x, [2, 3], axis=0)

print np.repeat(x,[3,38],axis=0)
#data.loc[[True,True,False]]

SyntaxError: invalid syntax (<ipython-input-107-8f1b8dd35c68>, line 3)

In [132]:
d4=data.iloc[[0,1],[0,1,2]]
d4

         SO2  Neg,Temp  Empresas
Phoenix   10      70.3       213
Miami     10      75.5       207

## Concatenar bases
Es posible que en algún momento debamos unir 2 o más Data.frames en solamnete uno.

In [140]:
d5=data.iloc[[0,1],[0,1,2]]

union=pd.concat([d4,d5],axis=0,keys=["x","y"])
union

           SO2  Neg,Temp  Empresas
x Phoenix   10      70.3       213
  Miami     10      75.5       207
y Phoenix   10      70.3       213
  Miami     10      75.5       207

Si se se quieren revisar sólo los elementos con x luego de la concatenación

In [142]:
union.loc["x"]

         SO2  Neg,Temp  Empresas
Phoenix   10      70.3       213
Miami     10      75.5       207

También es posible fundir 2 bases, para esto crearemos 2 DataFrames

In [170]:
d1= pd.DataFrame({'v1': ['1', '2', '3', '4'],
'v2': ['a', 'b', 'c', 'd'],
'v3': [1, 2, 3, 4]},
 index=[1, 3, 4, 5])
d2= pd.DataFrame({'v4': ['A0', 'A1', 'A2', 'A3'],
'v5': ['B0', 'B1', 'B2', 'B3'],
'v6': ['C0', 'C1', 'C2', 'C3'],
'v7': [5,6,7,8]},
index=[0, 1, 2, 3])
print(d1 ,"\n \n",d2)

  v1 v2  v3
1  1  a   1
3  2  b   2
4  3  c   3
5  4  d   4

    v4  v5  v6  v7
0  A0  B0  C0   5
1  A1  B1  C1   6
2  A2  B2  C2   7
3  A3  B3  C3   8

In [181]:
df=pd.concat([d1,d2],axis=1,join="outer")
print(df)
#df.dtypes
np.mean(df["v3"])

    v1   v2   v3   v4   v5   v6   v7
0  NaN  NaN  NaN   A0   B0   C0  5.0
1    1    a  1.0   A1   B1   C1  6.0
2  NaN  NaN  NaN   A2   B2   C2  7.0
3    2    b  2.0   A3   B3   C3  8.0
4    3    c  3.0  NaN  NaN  NaN  NaN
5    4    d  4.0  NaN  NaN  NaN  NaN

2.5

Si es necesario unir 2 tablas sin perder información de alguna de ellas usaremos el comando merge

In [216]:
unionizquierda=pd.merge(left=d1,right=d2, how='left', left_on=d1.index, right_on=d2.index)
unionizquierda

   key_0 v1 v2  v3   v4   v5   v6   v7
0      1  1  a   1   A1   B1   C1  6.0
1      3  2  b   2   A3   B3   C3  8.0
2      4  3  c   3  NaN  NaN  NaN  NaN
3      5  4  d   4  NaN  NaN  NaN  NaN

In [218]:
pd.isnull(unionizquierda)

   key_0     v1     v2     v3     v4     v5     v6     v7
0  False  False  False  False  False  False  False  False
1  False  False  False  False  False  False  False  False
2  False  False  False  False   True   True   True   True
3  False  False  False  False   True   True   True   True

## Aplicar funciones sobre columnas o filas
Para aplicar una función en una columna o fila, puedes usar el método apply() de DataFrame.

In [192]:
data.apply(np.sum,axis=0)

SO2               1232.00
Neg,Temp          2286.30
Empresas         18987.00
Población        24953.00
Viento             387.20
Precipitación     1507.53
Dias              4670.00
dtype: float64

Para aplicar la función a una columna especifica, puedes especificar la columna de la siguiente forma:

In [207]:
data["SO2"].apply(np.sqrt).head()

Phoenix         3.162278
Miami           3.162278
Memphis         3.162278
Houston         3.162278
Alburquerque    3.316625
Name: SO2, dtype: float64

## Ordenar el Data.Frame

In [216]:
data.sort_values(by=['SO2',"Empresas"],ascending=True).head(10)

              SO2  Neg,Temp  Empresas  Población  Viento  Precipitación  Dias
Wichita         8      56.6       125        277    12.7          30.58    82
New             9      68.3       204        361     8.4          56.77   113
Dallas          9      66.2       641        844    10.9          35.94    78
Miami          10      75.5       207        335     9.0          59.80   128
Phoenix        10      70.3       213        582     6.0           7.05    36
Memphis        10      61.6       337        624     9.2          49.10   105
Houston        10      68.9       721       1233    10.8          48.19   103
Alburquerque   11      56.8        46        244     8.9           7.77    58
Buffalo        11      47.1       391        463    12.4          36.11   166
San            12      56.7       453        716     8.7          20.66    67

## Omitir información duplicada
Para eliminar filas duplicadas de un DataFrame, usa el método drop_duplicates () del DataFrame.

In [219]:
    data.duplicated().head()

Phoenix         False
Miami           False
Memphis         False
Houston         False
Alburquerque    False
dtype: bool

In [221]:
data.drop_duplicates().head()

              SO2  Neg,Temp  Empresas  Población  Viento  Precipitación  Dias
Phoenix        10      70.3       213        582     6.0           7.05    36
Miami          10      75.5       207        335     9.0          59.80   128
Memphis        10      61.6       337        624     9.2          49.10   105
Houston        10      68.9       721       1233    10.8          48.19   103
Alburquerque   11      56.8        46        244     8.9           7.77    58

## Borrar una columna o una fila

Para eliminar una columna o fila completa, podemos usar el método drop () del DataFrame especificando el nombre de la columna o fila.

In [244]:
data.drop(data.columns[0:2],axis=1).head()#Para borrar las columnas  en el indice 0, 1

              Empresas  Población  Viento  Precipitación  Dias
Phoenix            213        582     6.0           7.05    36
Miami              207        335     9.0          59.80   128
Memphis            337        624     9.2          49.10   105
Houston            721       1233    10.8          48.19   103
Alburquerque        46        244     8.9           7.77    58

In [246]:
data.drop(data.index[0:2],axis=0).head()#Para borrar las filas   en el indice 0, 1

              SO2  Neg,Temp  Empresas  Población  Viento  Precipitación  Dias
Memphis        10      61.6       337        624     9.2          49.10   105
Houston        10      68.9       721       1233    10.8          48.19   103
Alburquerque   11      56.8        46        244     8.9           7.77    58
Buffalo        11      47.1       391        463    12.4          36.11   166
Chicago       110      50.6      3344       3369    10.4          34.44   122

## Resumen de los datos

In [224]:
data.describe()

,SO2,"Neg,Temp",Empresas,Población,Viento,Precipitación,Dias
count,41.000000,41.000000,41.000000,41.000000,41.000000,41.000000,41.000000
mean,30.048780,55.763415,463.097561,608.609756,9.443902,36.769024,113.902439
std,23.472272,7.227716,563.473948,579.113023,1.428644,11.771550,26.506419
min,8.000000,43.500000,35.000000,71.000000,6.000000,7.050000,36.000000
25%,13.000000,50.600000,181.000000,299.000000,8.700000,30.960000,103.000000
50%,26.000000,54.600000,347.000000,515.000000,9.300000,38.740000,115.000000
75%,35.000000,59.300000,462.000000,717.000000,10.600000,43.110000,128.000000
max,110.000000,75.500000,3344.000000,3369.000000,12.700000,59.800000,166.000000

30.048780487804876

## Estructuras de control de flujo condicionales para filtrar información

Las estructuras de control condicionales, son aquellas que nos permiten evaluar si una o más condiciones se cumplen, para decir qué acción vamos a ejecutar. La evaluación de condiciones, solo puede arrojar 1 de 2 resultados: verdadero o falso (True o False).

|**Símbolo**|	**Significado**|	**Ejemplo**|	**Resultado**|
|:---:|:---:|:---:|:---:|
| `==`|	Igual que|	5 `==`7	|False|
|`!=`	|Distinto que|	rojo `!=` verde|	True|
|`<`|	Menor que|	8 `<` 12|	True|
|`>`|	Mayor que|	12 `>` 7|	True|
|`<=`|Menor o igual que|	12 `<=` 12|	True|
|`>=`|	Mayor o igual que|	4 `>= 5`|	False|

Si es necesario realizar un filtro de un Data.Frame es posible usando estas condiciones.

### Ejemplo
Para la base de datos data deseamos hacer un filtro para ver los estados con valores de SO2 menores a 10

In [253]:
Datafiltrada = data[data["SO2"] < 10]
print(Datafiltrada)

         SO2  Neg,Temp  Empresas  Población  Viento  Precipitación  Dias
Wichita    8      56.6       125        277    12.7          30.58    82
Dallas     9      66.2       641        844    10.9          35.94    78
New        9      68.3       204        361     8.4          56.77   113

Es posible crear condiciones múltiples en una misma instrucción, para evaluar más de una condición simultáneamente, se utilizan operadores lógicos:




|Operador|	Ejemplo	|Explicación	|Resultado|
| :---: | :---: | :---: | :---: |
|`&`|	5 `==` 7 and 7 `<` 12	|False and False|	False|
|`&`|	9 `<` 12 and 12 `>` 7	|True and True|	True|
|`&`|	9 `<` 12 and 12 `>` 15	|True and False|	False|
|` \| ` |	12 `==` 12 or 15 `<` 7	|True or False|	True|
|` \| ` |	7 `>` 5 or 9 `<` 12	|True or True|	True|
|`^`|	4 `==` 4 xor 9 `>` 3	|True o True|	False|
|`^`|	4 `==` 4 xor 9 `<` 3	|True o False|	True|

### Ejemplo 
Para la base de datos data deseamos hacer un filtro para ver los estados con valores de SO2 menores a 10 y con viento mayor a 10.

In [124]:
Datafiltrada2 = data[(data["SO2"] < 10) | (data["Viento"]>10)]
print(Datafiltrada2)

                 SO2  Neg,Temp  Empresas  Población  Viento  Precipitación  \
Houston           10      68.9       721       1233    10.8          48.19
Buffalo           11      47.1       391        463    12.4          36.11
Chicago          110      50.6      3344       3369    10.4          34.44
Omaha             14      51.5       181        347    10.9          30.18
Milwaukee         16      45.7       569        717    11.8          29.07
Norfolk           31      59.3        96        308    10.6          44.68
Detroit           35      49.9      1064       1513    10.1          30.96
Cleveland         65      49.7      1007        751    10.9          34.99
Wichita            8      56.6       125        277    12.7          30.58
Dallas             9      66.2       641        844    10.9          35.94
Providence        94      50.0       343        179    10.6          42.75
Des               17      49.0       104        201    11.2          30.85
New                9      68.3       204        361     8.4          56.77
Minneapolis-St,   29      43.5       699        744    10.6          25.94

                 Dias So2.cha      S02.2
Houston           103    Bajo   3.162278
Buffalo           166    Bajo   3.316625
Chicago           122    Alto  10.488088
Omaha              98    Bajo   3.741657
Milwaukee         123    Bajo   4.000000
Norfolk           116    Alto   5.567764
Detroit           129    Alto   5.916080
Cleveland         155    Alto   8.062258
Wichita            82    Bajo   2.828427
Dallas             78    Bajo   3.000000
Providence        125    Alto   9.695360
Des               103    Bajo   4.123106
New               113    Bajo   3.000000
Minneapolis-St,   137    Alto   5.385165

## Exportar bases 
para esto es necesario instalar el modulo openpyxl

In [283]:
!pip install openpyxl
import openpyxl

Requirement already satisfied: openpyxl in c:\users\antonino\anaconda3\ana\lib\site-packages (3.0.0)
Requirement already satisfied: jdcal in c:\users\antonino\anaconda3\ana\lib\site-packages (from openpyxl) (1.4.1)
Requirement already satisfied: et-xmlfile in c:\users\antonino\anaconda3\ana\lib\site-packages (from openpyxl) (1.0.1)

In [ ]:
usamos el comando to.excel para exportar la base de datos resultante

In [126]:
Datafiltrada2.to_excel("pandasExcel.xlsx", "Sheet1")

## Ejercicio

Para la base de datos Craneos.csv

1. Cargue la base 
2. Elimine la primera columna y a los últimos 10 individuos.
3. Cambie el nombre de la variable "Anchura.Cara" a "Anchuro.Cara"
4. Filtre a los individuos que cumplan con:
 a.Longitud menor o igual a 13 o anchura mayor a 13
 b. Tipo=R1.
Asigne los resultados a un objeto llamado craneos.a para el literal a y craneos.b para el literal b
5. Encuentre las medidas resumen  de los objetos craneos.a y craneos.b

## Creación de nuevas variables 
Es posible crear nuevas columnas sobre el DataFrame

In [122]:
import numpy as np
data["S02.2"]=np.sqrt(data["SO2"])
data.tail()

False

In [211]:
data.loc[data['SO2']<20,"So2.cha"]="bajo"
data.loc[data['SO2']>=20,"So2.cha"]="al to"

data

,SO2,"Neg,Temp",Empresas,Población,Viento,Precipitación,Dias,So2.cha,S02.2
Phoenix,10,70.3,213,582,6.0,7.05,36,bajo,3.162278
Miami,10,75.5,207,335,9.0,59.80,128,bajo,3.162278
Memphis,10,61.6,337,624,9.2,49.10,105,bajo,3.162278
Houston,10,68.9,721,1233,10.8,48.19,103,bajo,3.162278
Alburquerque,11,56.8,46,244,8.9,7.77,58,bajo,3.316625
Buffalo,11,47.1,391,463,12.4,36.11,166,bajo,3.316625
Chicago,110,50.6,3344,3369,10.4,34.44,122,al to,10.488088
Little,13,61.0,91,132,8.2,48.52,100,bajo,3.605551
Jacksonville,14,68.4,136,529,8.8,54.47,116,bajo,3.741657
Omaha,14,51.5,181,347,10.9,30.18,98,bajo,3.741657
Milwaukee,16,45.7,569,717,11.8,29.07,123,bajo,4.000000
Denver,17,51.9,454,515,9.0,12.95,86,bajo,4.123106
Nashville,18,59.4,275,448,7.9,46.00,119,bajo,4.242641
Cincinnati,23,54.0,462,453,7.1,39.04,132,al to,4.795832
Atlanta,24,61.5,368,497,9.1,48.34,115,al to,4.898979
Columbus,26,51.5,266,540,8.6,37.01,134,al to,5.099020
Richmond,26,57.8,197,299,7.6,42.59,115,al to,5.099020
Indianapolis,28,52.3,361,746,9.7,38.74,121,al to,5.291503
Washington,29,57.3,434,757,9.3,38.89,111,al to,5.385165
Seattle,29,51.1,379,531,9.4,38.79,164,al to,5.385165
Louisville,30,55.6,291,593,8.3,43.11,123,al to,5.477226
Norfolk,31,59.3,96,308,10.6,44.68,116,al to,5.567764
Charleston,31,55.2,35,71,6.5,40.75,148,al to,5.567764
Detroit,35,49.9,1064,1513,10.1,30.96,129,al to,5.916080
Wilmington,36,54.0,80,80,9.0,40.25,114,al to,6.000000
Albany,46,47.6,44,116,8.8,33.36,135,al to,6.782330
Baltimore,47,55.0,625,905,9.6,41.31,111,al to,6.855655
Hartford,56,49.1,412,158,9.0,43.37,127,al to,7.483315
Pittsburgh,61,50.4,347,520,9.4,36.22,147,al to,7.810250
Cleveland,65,49.7,1007,751,10.9,34.99,155,al to,8.062258
Philadelphia,69,54.6,1692,1950,9.6,39.93,115,al to,8.306624
Wichita,8,56.6,125,277,12.7,30.58,82,bajo,2.828427
Dallas,9,66.2,641,844,10.9,35.94,78,bajo,3.000000
Providence,94,50.0,343,179,10.6,42.75,125,al to,9.695360
Kansas,14,54.5,381,507,10.0,37.00,99,bajo,3.741657
San,12,56.7,453,716,8.7,20.66,67,bajo,3.464102
Salt,28,51.0,137,176,8.7,15.17,89,al to,5.291503
"St,",56,55.9,775,622,9.5,35.89,105,al to,7.483315
Des,17,49.0,104,201,11.2,30.85,103,bajo,4.123106
New,9,68.3,204,361,8.4,56.77,113,bajo,3.000000
"Minneapolis-St,",29,43.5,699,744,10.6,25.94,137,al to,5.385165

## Reemplazar subcadena para todos los campos de una columna

In [212]:
#data["So2.cha"]=
print(data["So2.cha"].replace({' ':''},regex=True))

Phoenix            bajo
Miami              bajo
Memphis            bajo
Houston            bajo
Alburquerque       bajo
Buffalo            bajo
Chicago            alto
Little             bajo
Jacksonville       bajo
Omaha              bajo
Milwaukee          bajo
Denver             bajo
Nashville          bajo
Cincinnati         alto
Atlanta            alto
Columbus           alto
Richmond           alto
Indianapolis       alto
Washington         alto
Seattle            alto
Louisville         alto
Norfolk            alto
Charleston         alto
Detroit            alto
Wilmington         alto
Albany             alto
Baltimore          alto
Hartford           alto
Pittsburgh         alto
Cleveland          alto
Philadelphia       alto
Wichita            bajo
Dallas             bajo
Providence         alto
Kansas             bajo
San                bajo
Salt               alto
St,                alto
Des                bajo
New                bajo
Minneapolis-St,    alto
Name: So2.cha, dtype: object

## Agrupamiento

In [238]:
agru=data.groupby(["So2.cha"])
agru.first()
print(agru.mean())

               SO2   Neg,Temp    Empresas   Población    Viento  \
So2.cha
al to    43.869565  52.908696  585.130435  690.347826  9.234783
bajo     12.388889  59.411111  307.166667  504.166667  9.711111

         Precipitación        Dias     S02.2
So2.cha
al to        37.674783  125.652174  6.440321
bajo         35.611667   98.888889  3.494126

## Ejercicio 

1. Para la base de datos Craneos.csv, cree una nueva variable llamada Longitud.2 la cual tenga las siguientes categorías.

    * pequeno si mide menos de 10
    * mediano si mide entre 10 y 20 
    * grande si mide mas de 10.
    
    
2. Reemplace la letra n por ñ solamente en la categoría pequeño, use la función replace.
3. Encuentre la mediana de la variable Anchura para las categorás pequeño, mediano y grande.